Evangelos_Constantinou_Diversity_Statement.tex
% Created 2021-11-06 Sat 12:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.75in]{geometry}
\setlength{\parskip}{.10in}
\author{Evangelos Constantinou}
\date{}
\title{\bf{Diversity Statement}}
\hypersetup{
 pdfauthor={Evangelos Constantinou},
 pdftitle={\bf{Diversity Statement}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
My lived experience as a first generation college graduate and an immigrant to the United States ground my commitment to diversity and inclusion.
I can only describe challenges I faced as an isolated newcomer, unaware of available support or how to seek help for several months after first arriving on the University of Illinois campus.
My background makes me particularly sensitive to the detrimental impact exclusion and isolation have on students' well-being and academic success.

I was fortunate to be part of a very diverse cohort at UIUC, with fellow graduate students from all around the world, on a campus with over 14,000 international students hailing from over 100 countries.
Once I became more aware of the rich diversity of the Champaign-Urbana community, I felt welcomed, that I belonged, and that my department wanted me to succeed.
I firmly believe that it is imperative for academic institutions to promote diversity and inclusion of everyone, with special attention to marginalized groups. 

While serving as a head teaching assistant at the University of Illinois, I had the opportunity to work closely with services such as the Division of Disability Resources and Educational Services (DRES).
With support and resources from DRES, I was able to help ensure students with disabilities had equal opportunity to succeed in my classroom. 
Collaborating with DRES to support students improved my understanding of the challenges faced by students with disabilities.
This enabled my teaching assistants and me to educate ourselves and respond to students’ needs with accommodations for coursework and classroom environment without compromising the quality of education provided.

Through this experience, I learned that an educator must strive to develop an inclusive environment which provides conditions for the academic and social success of all students.
Teaching students from all walks of life has been eye-opening and motivated me to expand my research agenda to issues relating to voting rights and representation of marginalized groups.

Every  academic community must exemplify the principles of diversity and inclusion in intention, word, and action.
We need to provide the tools to every individual to succeed both within and beyond the academy.
I must use my privileged position in the classroom, in committee meetings and admission committees to reach, enfranchise and make space for marginalized and underrepresented communities that face barriers to equity and inclusion.
I am committed to using my role as a faculty member to continue listening to underrepresented and historically
excluded groups to better understand the challenges encountered by different members of our community,
strengthen my skills as an inclusive instructor, and ensure all students and faculty I interact with are treated with dignity and respect.
\end{document}